Котельников_АБ_70153995/src/Documents/ЗаявкаНаПодбор/ЗаявкаНаПодбор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПодбор</name>
  <basedOn>Catalog.ПрофилиДолжностей</basedOn>
  <registerRecords>AccumulationRegister.ДвиженияЗаявокНаПодбор</registerRecords>
  <attributes>
    <name>ПланируемыйСрокЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЗаявку</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаПодбор</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторЗаявки</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОткрытияВакансии</name>
    <type>
      <types>EnumRef.ПричиныОткрытияВакансий</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВакантнаяДолжность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДолжности</name>
    <type>
      <types>EnumRef.КатегорииДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧеловек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильДолжности</name>
    <type>
      <types>CatalogRef.ПрофилиДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>Образование</name>
    <type>
      <types>EnumRef.УровниОбразования</types>
    </type>
  </attributes>
  <attributes>
    <name>ОпытРаботы</name>
    <type>
      <types>EnumRef.ОпытРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностныеОбязанности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Требования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Условия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗанятости</name>
    <type>
      <types>EnumRef.ТипыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>EnumRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматРаботы</name>
    <type>
      <types>EnumRef.ФорматыРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаТрудаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаТрудаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоВычетаНалога</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКЗаявке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетПоиска</name>
    <type>
      <types>EnumRef.ПриоритетыПоиска</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КлючевыеНавыки</name>
    <attributes>
      <name>Навык</name>
      <type>
        <types>CatalogRef.КлючевыеНавыки</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньВладения</name>
      <type>
        <types>EnumRef.УровниПрофессиональныхНавыков</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛичныеКачества</name>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.ЛичныеКачества</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗнанияЯзыков</name>
    <attributes>
      <name>Язык</name>
      <type>
        <types>CatalogRef.Языки</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньВладения</name>
      <type>
        <types>EnumRef.УровниЗнанийЯзыков</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Котельников_АБ_70153995/src/AccumulationRegisters/ДвиженияЗаявокНаПодбор/ДвиженияЗаявокНаПодбор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияЗаявокНаПодбор</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаПодбор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриоритетПоиска</name>
    <type>
      <types>EnumRef.ПриоритетыПоиска</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВакантнаяДолжность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнициаторЗаявки</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОткрытияВакансии</name>
    <type>
      <types>EnumRef.ПричиныОткрытияВакансий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПланируемыйСрокЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Котельников_АБ_70153995/src/Documents/ЗаявкаНаПодбор/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ПрофилиДолжностей") Тогда
		// Заполнение шапки
		ГрафикРаботы = ДанныеЗаполнения.ГрафикРаботы;
		ДоВычетаНалога = ДанныеЗаполнения.ДоВычетаНалога;
		ДолжностныеОбязанности = ДанныеЗаполнения.ДолжностныеОбязанности;
		ВакантнаяДолжность = ДанныеЗаполнения.Должность;
		КатегорияДолжности = ДанныеЗаполнения.КатегорияДолжности;
		Образование = ДанныеЗаполнения.Образование;
		ОплатаТрудаДо = ДанныеЗаполнения.ОплатаТрудаДо;
		ОплатаТрудаОт = ДанныеЗаполнения.ОплатаТрудаОт;
		ОпытРаботы = ДанныеЗаполнения.ОпытРаботы;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ИнициаторЗаявки = ДанныеЗаполнения.РуководительПодразделения;
		ПрофильДолжности = ДанныеЗаполнения.Ссылка;
		ТипЗанятости = ДанныеЗаполнения.ТипЗанятости;
		Требования = ДанныеЗаполнения.Требования;
		Условия = ДанныеЗаполнения.Условия;
		ФорматРаботы = ДанныеЗаполнения.ФорматРаботы;
		Для Каждого ТекСтрокаЗнанияЯзыков Из ДанныеЗаполнения.ЗнанияЯзыков Цикл
			НоваяСтрока = ЗнанияЯзыков.Добавить();
			НоваяСтрока.УровеньВладения = ТекСтрокаЗнанияЯзыков.УровеньВладения;
			НоваяСтрока.Язык = ТекСтрокаЗнанияЯзыков.Язык;
		КонецЦикла;
		Для Каждого ТекСтрокаЛичныеКачества Из ДанныеЗаполнения.ЛичныеКачества Цикл
			НоваяСтрока = ЛичныеКачества.Добавить();
			НоваяСтрока.Качество = ТекСтрокаЛичныеКачества.Качество;
		КонецЦикла;
		Для Каждого ТекСтрокаПрофессиональныеНавыки Из ДанныеЗаполнения.КлючевыеНавыки Цикл
			НоваяСтрока = КлючевыеНавыки.Добавить();
			НоваяСтрока.Навык = ТекСтрокаПрофессиональныеНавыки.Навык;
			НоваяСтрока.УровеньВладения = ТекСтрокаПрофессиональныеНавыки.УровеньВладения;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр накопления ДвиженияЗаявокНаПодбор 
	Движения.ДвиженияЗаявокНаПодбор.Записывать = Истина;
	Движение = Движения.ДвиженияЗаявокНаПодбор.Добавить();
	Движение.Период = Дата;
	Движение.СтатусЗаявки = СтатусЗаявки;
	Движение.ПриоритетПоиска = ПриоритетПоиска;
	Движение.Подразделение = Подразделение;
	Движение.ВакантнаяДолжность = ВакантнаяДолжность;
	Движение.ИнициаторЗаявки = ИнициаторЗаявки;
	Движение.ПричинаОткрытияВакансии = ПричинаОткрытияВакансии;
	Движение.ПланируемыйСрокЗакрытия = ПланируемыйСрокЗакрытия;
    Движение.Количество = 1;

КонецПроцедуры
